In [40]:
import pandas as pd
import numpy as np

In [5]:
train = pd.read_csv('C:/users/micha/Desktop/Bemidji Meetup/titanic/train.csv')
test = pd.read_csv('C:/users/micha/Desktop/Bemidji Meetup/titanic/test.csv')

In [7]:
print(train.shape)
print(test.shape)

(891, 12)
(418, 11)

In [23]:
# we can create a submission file for later with the Passenger ID
sub = pd.DataFrame(data= test.PassengerId)

In [24]:
sub.head()

   PassengerId
0          892
1          893
2          894
3          895
4          896

In [29]:
# concat both dataframes for easier data manipulation
combined = pd.concat([train,test])

In [30]:
combined.head(3)

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282

In [31]:
# starting with age
combined.Age.describe()

count    1046.000000
mean       29.881138
std        14.413493
min         0.170000
25%        21.000000
50%        28.000000
75%        39.000000
max        80.000000
Name: Age, dtype: float64

In [32]:
# there doesnt appear to be any major outliers on age but we do have some missing values
combined[combined.Age.isnull()]

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
5,NaN,NaN,Q,8.4583,"Moran, Mr. James",0,6,3,male,0,0.0,330877
17,NaN,NaN,S,13.0000,"Williams, Mr. Charles Eugene",0,18,2,male,0,1.0,244373
19,NaN,NaN,C,7.2250,"Masselmani, Mrs. Fatima",0,20,3,female,0,1.0,2649
26,NaN,NaN,C,7.2250,"Emir, Mr. Farred Chehab",0,27,3,male,0,0.0,2631
28,NaN,NaN,Q,7.8792,"O'Dwyer, Miss. Ellen ""Nellie""",0,29,3,female,0,1.0,330959
29,NaN,NaN,S,7.8958,"Todoroff, Mr. Lalio",0,30,3,male,0,0.0,349216
31,NaN,B78,C,146.5208,"Spencer, Mrs. William Augustus (Marie Eugenie)",0,32,1,female,1,1.0,PC 17569
32,NaN,NaN,Q,7.7500,"Glynn, Miss. Mary Agatha",0,33,3,female,0,1.0,335677
36,NaN,NaN,C,7.2292,"Mamee, Mr. Hanna",0,37,3,male,0,1.0,2677
42,NaN,NaN,C,7.8958,"Kraeff, Mr. Theodor",0,43,3,male,0,0.0,349253
45,NaN,NaN,S,8.0500,"Rogers, Mr. William John",0,46,3,male,0,0.0,S.C./A.4. 23567
46,NaN,NaN,Q,15.5000,"Lennon, Mr. Denis",0,47,3,male,1,0.0,370371
47,NaN,NaN,Q,7.7500,"O'Driscoll, Miss. Bridget",0,48,3,female,0,1.0,14311
48,NaN,NaN,C,21.6792,"Samaan, Mr. Youssef",0,49,3,male,2,0.0,2662
55,NaN,C52,S,35.5000,"Woolner, Mr. Hugh",0,56,1,male,0,1.0,19947
64,NaN,NaN,C,27.7208,"Stewart, Mr. Albert A",0,65,1,male,0,0.0,PC 17605
65,NaN,NaN,C,15.2458,"Moubarek, Master. Gerios",1,66,3,male,1,1.0,2661
76,NaN,NaN,S,7.8958,"Staneff, Mr. Ivan",0,77,3,male,0,0.0,349208
77,NaN,NaN,S,8.0500,"Moutal, Mr. Rahamin Haim",0,78,3,male,0,0.0,374746
82,NaN,NaN,Q,7.7875,"McDermott, Miss. Brigdet Delia",0,83,3,female,0,1.0,330932
87,NaN,NaN,S,8.0500,"Slocovski, Mr. Selman Francis",0,88,3,male,0,0.0,SOTON/OQ 392086
95,NaN,NaN,S,8.0500,"Shorney, Mr. Charles Joseph",0,96,3,male,0,0.0,374910
101,NaN,NaN,S,7.8958,"Petroff, Mr. Pastcho (""Pentcho"")",0,102,3,male,0,0.0,349215
107,NaN,NaN,S,7.7750,"Moss, Mr. Albert Johan",0,108,3,male,0,1.0,312991
109,NaN,NaN,Q,24.1500,"Moran, Miss. Bertha",0,110,3,female,1,1.0,371110
121,NaN,NaN,S,8.0500,"Moore, Mr. Leonard Charles",0,122,3,male,0,0.0,A4. 54510
126,NaN,NaN,Q,7.7500,"McMahon, Mr. Martin",0,127,3,male,0,0.0,370372
128,NaN,F E69,C,22.3583,"Peter, Miss. Anna",1,129,3,female,1,1.0,2668
140,NaN,NaN,C,15.2458,"Boulos, Mrs. Joseph (Sultana)",2,141,3,female,0,0.0,2678
154,NaN,NaN,S,7.3125,"Olsen, Mr. Ole Martin",0,155,3,male,0,0.0,Fa 265302
...,...,...,...,...,...,...,...,...,...,...,...,...
268,NaN,NaN,S,8.0500,"Howard, Miss. May Elizabeth",0,1160,3,female,0,NaN,A. 2. 39186
271,NaN,NaN,Q,7.7500,"Fox, Mr. Patrick",0,1163,3,male,0,NaN,368573
273,NaN,NaN,Q,15.5000,"Lennon, Miss. Mary",0,1165,3,female,1,NaN,370371
274,NaN,NaN,C,7.2250,"Saade, Mr. Jean Nassr",0,1166,3,male,0,NaN,2676
282,NaN,NaN,Q,7.7500,"Fleming, Miss. Honora",0,1174,3,female,0,NaN,364859
286,NaN,NaN,S,7.2500,"Franklin, Mr. Charles (Charles Fardon)",0,1178,3,male,0,NaN,SOTON/O.Q. 3101314
288,NaN,F E46,C,7.2292,"Mardirosian, Mr. Sarkis",0,1180,3,male,0,NaN,2655
289,NaN,NaN,S,8.0500,"Ford, Mr. Arthur",0,1181,3,male,0,NaN,A/5 1478
290,NaN,NaN,S,39.6000,"Rheims, Mr. George Alexander Lucien",0,1182,1,male,0,NaN,PC 17607
292,NaN,NaN,C,7.2292,"Nasr, Mr. Mustafa",0,1184,3,male,0,NaN,2652
297,NaN,NaN,C,21.6792,"Samaan, Mr. Hanna",0,1189,3,male,2,NaN,2662
301,NaN,D,C,15.0458,"Malachard, Mr. Noel",0,1193,2,male,0,NaN,237735
304,NaN,NaN,Q,7.7500,"McCarthy, Miss. Catherine Katie""""",0,1196,3,female,0,NaN,383123
312,NaN,NaN,S,7.5750,"Sadowitz, Mr. Harry",0,1204,3,male,0,NaN,LP 1588
332,NaN,NaN,C,7.2250,"Thomas, Mr. Tannous",0,1224,3,male,0,NaN,2684
339,NaN,NaN,C,7.2292,"Betros, Master. Seman",0,1231,3,male,0,NaN,2622
342,NaN,NaN,S,69.5500,"Sage, Mr. John George",9,1234,3,male,1,NaN,CA. 2343
344,NaN,NaN,S,14.5000,"van Billiard, Master. James William",1,1236,3,male,1,NaN,A/5. 851
357,NaN,NaN,S,7.8792,"Lockyer, Mr. Edward",0,1249,3,male,0,NaN,1222
358,NaN,NaN,Q,7.7500,"O'Keefe, Mr. Patrick",0,1250,3,male,0,NaN,368402
365,NaN,NaN,S,69.5500,"Sage, Mrs. John (Annie Bullen)",9,1257,3,female,1,NaN,CA. 2343
366,NaN,NaN,C,14.4583,"Caram, Mr. Joseph",0,1258,3,male,1,NaN,2689
380,NaN,NaN,Q,7.7500,"O'Connor, Mr. Patrick",0,1272,3,male,0,NaN,366713
382,NaN,NaN,S,14.5000,"Risien, Mrs. Samuel (Emma)",0,1274,3,female,0,NaN,364498
384,NaN,NaN,S,12.8750,"Wheeler, Mr. Edwin Frederick""""",0,1276,2,male,0,NaN,SC/PARIS 2159
408,NaN,NaN,Q,7.7208,"Riordan, Miss. Johanna Hannah""""",0,1300,3,female,0,NaN,334915
410,NaN,NaN,Q,7.7500,"Naughton, Miss. Hannah",0,1302,3,female,0,NaN,365237
413,NaN,NaN,S,8.0500,"Spector, Mr. Woolf",0,1305,3,male,0,NaN,A.5. 3236
416,NaN,NaN,S,8.0500,"Ware, Mr. Frederick",0,1308,3,male,0,NaN,359309
417,NaN,NaN,C,22.3583,"Peter, Master. Michael J",1,1309,3,male,1,NaN,2668

In [33]:
# we have 263 missing values.  If you recall, last time we imputed the missing ages with a mean - 29 years old
# we are going to take a different approach this time around becasue age is likely very important
# I think a good indicator of age may be title, so lets extract titles first
combined['Title'] = combined['Name'].map(lambda name:name.split(',')[1].split('.')[0].strip())
# and we can drop Name and while we are at, passenger id
combined.drop(['Name', 'PassengerId', 'Ticket'], axis=1, inplace=True)

In [34]:
combined.head(3)

    Age Cabin Embarked     Fare  Parch  Pclass     Sex  SibSp  Survived Title
0  22.0   NaN        S   7.2500      0       3    male      1       0.0    Mr
1  38.0   C85        C  71.2833      0       1  female      1       1.0   Mrs
2  26.0   NaN        S   7.9250      0       3  female      0       1.0  Miss

In [41]:
combined.Title.value_counts(dropna=False)

Mr              757
Miss            260
Mrs             197
Master           61
Rev               8
Dr                8
Col               4
Mlle              2
Ms                2
Major             2
Sir               1
Mme               1
Capt              1
Jonkheer          1
Don               1
the Countess      1
Lady              1
Dona              1
Name: Title, dtype: int64

In [57]:
MrAge = combined.loc[combined.Title=='Mr', 'Age'].mean()
MissAge = combined.loc[combined.Title=='Miss', 'Age'].mean()
MrsAge = combined.loc[combined.Title=='Mrs', 'Age'].mean()
MasterAge = combined.loc[combined.Title=='Master', 'Age'].mean()
RevAge = combined.loc[combined.Title=='Rev', 'Age'].mean()
DrAge = combined.loc[combined.Title=='Dr', 'Age'].mean()
ColAge = combined.loc[combined.Title=='Col', 'Age'].mean()
MlleAge = combined.loc[combined.Title=='Mlle', 'Age'].mean()
MsAge = combined.loc[combined.Title=='Ms', 'Age'].mean()
MajorAge = combined.loc[combined.Title=='Major', 'Age'].mean()
SirAge = combined.loc[combined.Title=='Sir', 'Age'].mean()
MmeAge = combined.loc[combined.Title=='Mme', 'Age'].mean()
CaptAge = combined.loc[combined.Title=='Capt', 'Age'].mean()
JonkheerAge = combined.loc[combined.Title=='Jonkheer', 'Age'].mean()
DonAge = combined.loc[combined.Title=='Don', 'Age'].mean()
CountessAge = combined.loc[combined.Title=='the Countess', 'Age'].mean()
LadyAge = combined.loc[combined.Title=='Lady', 'Age'].mean()
DonaAge = combined.loc[combined.Title=='Dona', 'Age'].mean()